app/controllers/flights_controller.rb

SELECT "flights".* FROM "flights" WHERE "flights"."user_id" = $1  [["user_id", 1]]
---
    def index
      @user = current_user
      @flights = @user.flights.all

INSERT INTO "flights" ("Number", "originairport", "destinationairport", "departuretime", "arrivaltime", "seatsnumber", "passengersnumber", "price", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
    def create
      @user = current_user
      @flight = @user.flights.new(flight_params)


      respond_to do |format|
        if @flight.save