app/controllers/passengers_controller.rb

SELECT "passengers".* FROM "passengers"
---
  def index
    @passengers = Passenger.all

INSERT INTO "passengers" ("name", "passportnumber", "flight_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Mustapha"], ["passportnumber", "jridi"], ["flight_id", 1], ["created_at", "2019-01-26 01:44:54.173295"], ["updated_at", "2019-01-26 01:44:54.173295"]]
---
  def create
    @passenger = Passenger.new(passenger_params)
    respond_to do |format|
      if @passenger.save

SELECT  "passengers".* FROM "passengers" WHERE "passengers"."id" = $1 LIMIT $2  [["id", 42], ["LIMIT", 1]]
---
    def set_passenger
      @passenger = Passenger.find(params[:id])